/*
paiza 株式会社では新たに paiza くんの小さなアメを販売することになりました。
アメを何個入りで詰め合わせて販売するか迷っていた会社は、ちょうどいいアメの個数についてお客様にアンケートを取ることにしました。
アンケートの結果 N 件の回答が集まり、i 件目の回答では C_i 個が最適なアメの個数だと回答していました。(1 ≦ i ≦ N)
paiza としてはアンケートに答えてくれた人全員がちょうど希望の個数を買えるようにしたいと考えています。
そこで paiza では、アメが X 個入った詰め合わせを発注し、その詰め合わせをアンケートに答えてくれた人それぞれにいくつか送ることで全員の希望通りの個数のアメを送ろうと考えました。
詰め合わせるアメの個数が少なすぎても利益率が悪いので、できるだけ多くのアメを詰め合わせたものを発注したいです。
paiza にとって発注するのに最適な詰め合わせのアメの個数 X を答えてください。

入力される値
N
C_1
...
C_N


・1 行目で、与えられる整数の個数 N が与えられます。
・続く N 行にのうち i 行目では i 件目の回答のアメの数 C_i (1 ≦ i ≦ N) が与えられます。

入力値最終行の末尾に改行が１つ入ります。


*/